{"class_name": "Functional", "config": {"name": "main_model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 33], "dtype": "float64", "sparse": false, "ragged": false, "name": "input_layer"}, "name": "input_layer", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "backbone", "trainable": true, "dtype": "float64", "units": 250, "activation": "swish", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "backbone", "inbound_nodes": [[["input_layer", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "dtype": "float64", "rate": 0.0, "noise_shape": null, "seed": null}, "name": "dropout_1", "inbound_nodes": [[["backbone", 0, 0, {}]]]}, {"class_name": "ResidualBlock", "config": {"name": "hidden_residual_block_1", "trainable": true, "dtype": "float64", "n_neurons": 250, "activations": "swish", "kernel_initializer": "glorot_uniform", "dropout": {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float64", "rate": 0.0, "noise_shape": null, "seed": null}, "__passive_serialization__": true}}, "name": "hidden_residual_block_1", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "output_layer", "trainable": true, "dtype": "float64", "units": 33, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "output_layer", "inbound_nodes": [[["hidden_residual_block_1", 0, 0, {}]]]}], "input_layers": [["input_layer", 0, 0]], "output_layers": [["output_layer", 0, 0]]}, "keras_version": "2.9.0", "backend": "tensorflow"}